Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# WebImport_FeedReadOne
source: Read feed "{0}" ({1} item). This is a one-time import; new items are not fetched automatically.
de: Feed „{0}“ gelesen ({1} Eintrag). Dies ist ein einmaliger Import; neue Einträge werden nicht automatisch abgerufen.
es: Se leyó la fuente "{0}" ({1} elemento). Es una importación única; los elementos nuevos no se obtienen automáticamente.
ja: フィード「{0}」を読み込みました ({1} 件のアイテム)。これは 1 回限りのインポートで、新しいアイテムは自動的には取得されません。
zh_cn: 已读取源“{0}”（{1} 个条目）。这是一次性导入，不会自动获取新条目。

# WebImport_FeedReadMany
source: Read feed "{0}" ({1} items). This is a one-time import; new items are not fetched automatically.
de: Feed „{0}“ gelesen ({1} Einträge). Dies ist ein einmaliger Import; neue Einträge werden nicht automatisch abgerufen.
es: Se leyó la fuente "{0}" ({1} elementos). Es una importación única; los elementos nuevos no se obtienen automáticamente.
ja: フィード「{0}」を読み込みました ({1} 件のアイテム)。これは 1 回限りのインポートで、新しいアイテムは自動的には取得されません。
zh_cn: 已读取源“{0}”（{1} 个条目）。这是一次性导入，不会自动获取新条目。

# WebImport_ImportingProgress
source: Importing {0}/{1}...
de: Importiere {0}/{1}...
es: Importando {0}/{1}...
ja: インポート中 {0}/{1}...
zh_cn: 正在导入 {0}/{1}...

# WebImport_ImportedFeedItemsOne
source: Imported {0} of {1} feed item
de: {0} von {1} Feed-Eintrag importiert
es: Elemento de la fuente importado: {0} de {1}
ja: {1} 件中 {0} 件のフィード アイテムをインポートしました
zh_cn: 已导入 {0}/{1} 个源条目

# WebImport_ImportedFeedItemsMany
source: Imported {0} of {1} feed items
de: {0} von {1} Feed-Einträgen importiert
es: Elementos de la fuente importados: {0} de {1}
ja: {1} 件中 {0} 件のフィード アイテムをインポートしました
zh_cn: 已导入 {0}/{1} 个源条目

# WebImport_FeedImportCancelled
source: Feed import cancelled
de: Feed-Import abgebrochen
es: Importación de la fuente cancelada
ja: フィードのインポートをキャンセルしました
zh_cn: 源导入已取消

# WebImport_Error
source: Error: {0}
de: Fehler: {0}
ja: エラー: {0}
zh_cn: 错误：{0}

# WebImport_ParsingSitemap
source: Parsing sitemap...
de: Sitemap wird analysiert...
es: Analizando el sitemap...
ja: サイトマップを解析しています...
zh_cn: 正在解析站点地图...

# WebImport_SitemapFoundOne
source: Found {0} URL. Importing...
de: {0} URL gefunden. Import läuft...
es: Se encontró {0} URL. Importando...
ja: {0} 件の URL が見つかりました。インポートしています...
zh_cn: 找到 {0} 个 URL。正在导入...

# WebImport_SitemapFoundMany
source: Found {0} URLs. Importing...
de: {0} URLs gefunden. Import läuft...
es: Se encontraron {0} URL. Importando...
ja: {0} 件の URL が見つかりました。インポートしています...
zh_cn: 找到 {0} 个 URL。正在导入...

# WebImport_SitemapNoUrls
source: No URLs found in sitemap
de: Keine URLs in der Sitemap gefunden
es: No se encontraron URL en el sitemap
ja: サイトマップに URL が見つかりません
zh_cn: 站点地图中未找到 URL

# WebImport_ImportedSitemapUrlsOne
source: Imported {0} of {1} sitemap URL
de: {0} von {1} Sitemap-URL importiert
es: URL del sitemap importada: {0} de {1}
ja: {1} 件中 {0} 件のサイトマップ URL をインポートしました
zh_cn: 已导入 {0}/{1} 个站点地图 URL

# WebImport_ImportedSitemapUrlsMany
source: Imported {0} of {1} sitemap URLs
de: {0} von {1} Sitemap-URLs importiert
es: URL del sitemap importadas: {0} de {1}
ja: {1} 件中 {0} 件のサイトマップ URL をインポートしました
zh_cn: 已导入 {0}/{1} 个站点地图 URL

# WebImport_SitemapImportCancelled
source: Sitemap import cancelled
de: Sitemap-Import abgebrochen
es: Importación del sitemap cancelada
ja: サイトマップのインポートをキャンセルしました
zh_cn: 站点地图导入已取消

# WebImport_RowFailed
source: Failed: {0}
de: Fehlgeschlagen: {0}
es: Fallido: {0}
ja: 失敗: {0}
zh_cn: 失败：{0}

# Search_ReadyToSearch
source: Ready to search
de: Bereit zur Suche
es: Listo para buscar
ja: 検索の準備ができました
zh_cn: 可以开始搜索

# Search_Searching
source: Searching...
de: Suche läuft...
es: Buscando...
ja: 検索しています...
zh_cn: 正在搜索...

# Search_NoResultsIn
source: No results found in {0}ms
de: Keine Ergebnisse in {0} ms gefunden
es: No se encontraron resultados en {0} ms
ja: 結果は見つかりませんでした ({0} ms)
zh_cn: 未找到结果（{0} ms）

# Search_FoundResultsOne
source: Found {0} result in {1}ms
de: {0} Ergebnis in {1} ms gefunden
es: Se encontró {0} resultado en {1} ms
ja: {0} 件の結果が見つかりました ({1} ms)
zh_cn: 找到 {0} 条结果（{1} ms）

# Search_FoundResultsMany
source: Found {0} results in {1}ms
de: {0} Ergebnisse in {1} ms gefunden
es: Se encontraron {0} resultados en {1} ms
ja: {0} 件の結果が見つかりました ({1} ms)
zh_cn: 找到 {0} 条结果（{1} ms）

# Search_SearchFailed
source: Search failed. Please try again.
de: Suche fehlgeschlagen. Bitte versuchen Sie es erneut.
es: La búsqueda falló. Inténtelo de nuevo.
ja: 検索に失敗しました。もう一度お試しください。
zh_cn: 搜索失败。请重试。

# Search_FilterSaved
source: Filter saved
de: Filter gespeichert
es: Filtro guardado
ja: フィルターを保存しました
zh_cn: 筛选器已保存

# Search_FilterSaveFailed
source: Failed to save filter
de: Filter konnte nicht gespeichert werden
es: No se pudo guardar el filtro
ja: フィルターを保存できませんでした
zh_cn: 无法保存筛选器

# Search_FilterRemoved
source: Filter removed
de: Filter entfernt
es: Filtro eliminado
ja: フィルターを削除しました
zh_cn: 筛选器已删除

# Search_FilterRemoveFailed
source: Failed to remove filter
de: Filter konnte nicht entfernt werden
es: No se pudo eliminar el filtro
ja: フィルターを削除できませんでした
zh_cn: 无法删除筛选器

# Search_WorkflowInputSource
source: Source: Search result
de: Quelle: Suchergebnis
es: Fuente: Resultado de búsqueda
ja: ソース: 検索結果
zh_cn: 来源：搜索结果

# Search_WorkflowInputQuery
source: Query: {0}
de: Suchanfrage: {0}
es: Consulta: {0}
ja: クエリ: {0}
zh_cn: 查询：{0}

# Search_WorkflowInputDocument
source: Document: {0}
de: Dokument: {0}
es: Documento: {0}
ja: ドキュメント: {0}
zh_cn: 文档：{0}

# Search_WorkflowInputRelevance
source: Relevance: {0}%
de: Relevanz: {0} %
es: Relevancia: {0} %
ja: 関連度: {0}%
zh_cn: 相关性：{0}%

# Search_WorkflowInputPage
source: Page: {0}
de: Seite: {0}
es: Página: {0}
ja: ページ: {0}
zh_cn: 页码：{0}

# Search_WorkflowInputExcerpt
source: Excerpt
de: Auszug
es: Extracto
ja: 抜粋
zh_cn: 摘录

# Search_WorkflowInputNoExcerpt
source: No excerpt available.
de: Kein Auszug verfügbar.
es: No hay ningún extracto disponible.
ja: 抜粋はありません。
zh_cn: 没有可用的摘录。

# Search_WorkflowSourceLabel
source: Loaded search context from "{0}"
de: Suchkontext aus „{0}“ geladen
es: Se cargó el contexto de búsqueda de "{0}"
ja: 「{0}」から検索コンテキストを読み込みました
zh_cn: 已从“{0}”加载搜索上下文

# Search_HistoryJustNow
source: just now
de: gerade eben
es: justo ahora
ja: たった今
zh_cn: 刚刚

# Search_AllCollections
source: All Collections
de: Alle Sammlungen
es: Todas las colecciones
ja: すべてのコレクション
zh_cn: 全部合集

# Search_SavedFilterModeSemantic
source: semantic
de: semantisch
es: semántica
ja: セマンティック
zh_cn: 语义

# Search_SavedFilterModeKeyword
source: keyword
de: Stichwort
es: palabra clave
ja: キーワード
zh_cn: 关键词

# Search_SavedFilterModeHybrid
source: hybrid
es: híbrida
ja: ハイブリッド
zh_cn: 混合

# Comp_DetailLevelSummary
source: summary
de: Zusammenfassung
es: resumen
ja: 要約
zh_cn: 摘要

# Comp_DetailLevelDetailed
source: detailed
de: ausführlich
es: detallado
ja: 詳細
zh_cn: 详细

# Comp_DocumentsAvailableOne
source: {0} document available
de: {0} Dokument verfügbar
es: {0} documento disponible
ja: {0} 件のドキュメントを利用できます
zh_cn: 有 {0} 份文档可用

# Comp_DocumentsAvailableMany
source: {0} documents available
de: {0} Dokumente verfügbar
es: {0} documentos disponibles
ja: {0} 件のドキュメントを利用できます
zh_cn: 有 {0} 份文档可用

# Comp_LoadDocumentsFailed
source: Failed to load documents
de: Dokumente konnten nicht geladen werden
es: No se pudieron cargar los documentos
ja: ドキュメントを読み込めませんでした
zh_cn: 无法加载文档

# Comp_SelectAtLeastTwo
source: Select at least 2 documents to compare
de: Wählen Sie mindestens 2 Dokumente zum Vergleichen aus
es: Seleccione al menos 2 documentos para comparar
ja: 比較するドキュメントを 2 つ以上選択してください
zh_cn: 请至少选择 2 份文档进行对比

# Comp_AnalyzingDocuments
source: Analyzing documents...
de: Dokumente werden analysiert...
es: Analizando documentos...
ja: ドキュメントを分析しています...
zh_cn: 正在分析文档...

# Comp_ComparisonComplete
source: Comparison complete in {0}ms
de: Vergleich in {0} ms abgeschlossen
es: Comparación completada en {0} ms
ja: 比較が完了しました ({0} ms)
zh_cn: 对比已完成（{0} ms）

# Comp_ComparisonCancelled
source: Comparison cancelled
de: Vergleich abgebrochen
es: Comparación cancelada
ja: 比較をキャンセルしました
zh_cn: 对比已取消

# Comp_ComparisonFailed
source: Comparison failed: {0}
de: Vergleich fehlgeschlagen: {0}
es: Error en la comparación: {0}
ja: 比較に失敗しました: {0}
zh_cn: 对比失败：{0}

# Comp_ExportUnavailable
source: Export unavailable
de: Export nicht verfügbar
es: Exportación no disponible
ja: エクスポートは利用できません
zh_cn: 无法导出

# Comp_ExportCancelled
source: Export cancelled
de: Export abgebrochen
es: Exportación cancelada
ja: エクスポートをキャンセルしました
zh_cn: 导出已取消

# Comp_MarkdownFile
source: Markdown file
de: Markdown-Datei
es: archivo Markdown
ja: Markdown ファイル
zh_cn: Markdown 文件

# Comp_ReportSavedTo
source: Comparison report saved to {0}
de: Vergleichsbericht gespeichert unter {0}
es: Informe de comparación guardado en {0}
ja: 比較レポートを {0} に保存しました
zh_cn: 对比报告已保存到 {0}

# Comp_ExportFailed
source: Export failed
de: Export fehlgeschlagen
es: Error al exportar
ja: エクスポートに失敗しました
zh_cn: 导出失败

# AskFiles_IndexStatusLoading
source: Loading...
de: Wird geladen...
es: Cargando...
ja: 読み込んでいます...
zh_cn: 正在加载...

# AskFiles_KnowledgeBaseStatusUnavailable
source: Knowledge base status unavailable
de: Status der Wissensbasis nicht verfügbar
es: Estado de la base de conocimiento no disponible
ja: ナレッジベースの状態を取得できません
zh_cn: 无法获取知识库状态

# AskFiles_CitationLabelWithPage
source: [{0}] {1}, p.{2}
de: [{0}] {1}, S. {2}
es: [{0}] {1}, pág. {2}
ja: [{0}] {1}、{2} ページ
zh_cn: [{0}] {1}，第 {2} 页

# AskFiles_GenerationStoppedMarker
source: [Generation stopped]
de: [Generierung angehalten]
es: [Generación detenida]
ja: [生成を停止しました]
zh_cn: [已停止生成]

# AskFiles_GenerationStopped
source: Generation was stopped.
de: Die Generierung wurde angehalten.
es: Se detuvo la generación.
ja: 生成を停止しました。
zh_cn: 已停止生成。

# AskFiles_AnswerFailed
source: I encountered an error while searching your documents. Please try again, or check that your documents have been indexed.
de: Beim Durchsuchen Ihrer Dokumente ist ein Fehler aufgetreten. Versuchen Sie es erneut, oder prüfen Sie, ob Ihre Dokumente indiziert wurden.
es: Se produjo un error al buscar en sus documentos. Inténtelo de nuevo o compruebe que sus documentos se hayan indexado.
ja: ドキュメントの検索中にエラーが発生しました。もう一度お試しいただくか、ドキュメントのインデックスが作成されているか確認してください。
zh_cn: 搜索您的文档时出错。请重试，或检查您的文档是否已完成索引。

# AskFiles_AllCollections
source: All Collections
de: Alle Sammlungen
es: Todas las colecciones
ja: すべてのコレクション
zh_cn: 全部合集

# AskFiles_ChunksAvailableOne
source: {0} knowledge chunk available
de: {0} Wissensabschnitt verfügbar
es: {0} fragmento de conocimiento disponible
ja: {0} 件のナレッジ チャンクを利用できます
zh_cn: 有 {0} 个知识块可用

# AskFiles_ChunksAvailableMany
source: {0} knowledge chunks available
de: {0} Wissensabschnitte verfügbar
es: {0} fragmentos de conocimiento disponibles
ja: {0} 件のナレッジ チャンクを利用できます
zh_cn: 有 {0} 个知识块可用

# AskFiles_DocumentsBeingIndexed
source: Documents are being indexed...
de: Dokumente werden indiziert...
es: Se están indexando los documentos...
ja: ドキュメントのインデックスを作成しています...
zh_cn: 正在为文档建立索引...

# AskFiles_ImportToGetStarted
source: Import documents to get started
de: Importieren Sie Dokumente, um loszulegen
es: Importe documentos para empezar
ja: ドキュメントをインポートして始めましょう
zh_cn: 导入文档即可开始

# AskFiles_StatusUnavailable
source: Status unavailable
de: Status nicht verfügbar
es: Estado no disponible
ja: 状態を取得できません
zh_cn: 状态不可用

# Graph_LoadingGraph
source: Loading graph...
de: Graph wird geladen...
es: Cargando el grafo...
ja: グラフを読み込んでいます...
zh_cn: 正在加载图谱...

# Graph_BuildingGraph
source: Building knowledge graph...
de: Wissensgraph wird aufgebaut...
es: Construyendo el grafo de conocimiento...
ja: ナレッジ グラフを構築しています...
zh_cn: 正在构建知识图谱...

# Graph_NodeCountOne
source: {0} node
de: {0} Knoten
es: {0} nodo
ja: {0} 個のノード
zh_cn: {0} 个节点

# Graph_NodeCountMany
source: {0} nodes
de: {0} Knoten
es: {0} nodos
ja: {0} 個のノード
zh_cn: {0} 个节点

# Graph_ConnectionCountOne
source: {0} connection
de: {0} Verbindung
es: {0} conexión
ja: {0} 個の接続
zh_cn: {0} 个连接

# Graph_ConnectionCountMany
source: {0} connections
de: {0} Verbindungen
es: {0} conexiones
ja: {0} 個の接続
zh_cn: {0} 个连接

# Graph_BuildFailed
source: Failed to build graph
de: Graph konnte nicht aufgebaut werden
es: No se pudo construir el grafo
ja: グラフを構築できませんでした
zh_cn: 无法构建图谱

# Digest_NoReportsYet
source: No digest reports yet
de: Noch keine Digest-Berichte
es: Aún no hay informes de resumen
ja: ダイジェスト レポートはまだありません
zh_cn: 暂无摘要报告

# Digest_LastGenerated
source: Last generated {0}
de: Zuletzt erstellt am {0}
es: Última generación: {0}
ja: 最終生成: {0}
zh_cn: 上次生成时间：{0}

# Digest_NoReportsYetGenerateOne
source: No digest reports yet. Generate one to see your weekly summary.
de: Noch keine Digest-Berichte. Erstellen Sie einen, um Ihre Wochenzusammenfassung zu sehen.
es: Aún no hay informes de resumen. Genere uno para ver su resumen semanal.
ja: ダイジェスト レポートはまだありません。生成すると週次のまとめを確認できます。
zh_cn: 暂无摘要报告。生成一份即可查看您的每周总结。

# Digest_LoadReportsFailed
source: Failed to load reports
de: Berichte konnten nicht geladen werden
es: No se pudieron cargar los informes
ja: レポートを読み込めませんでした
zh_cn: 无法加载报告

# Digest_GeneratingDigest
source: Generating weekly digest...
de: Wochen-Digest wird erstellt...
es: Generando el resumen semanal...
ja: 週次ダイジェストを生成しています...
zh_cn: 正在生成每周摘要...

# Digest_DigestGenerated
source: Digest generated successfully
de: Digest erfolgreich erstellt
es: Resumen generado correctamente
ja: ダイジェストを生成しました
zh_cn: 摘要已成功生成

# Digest_GenerateDigestFailed
source: Failed to generate digest
de: Digest konnte nicht erstellt werden
es: No se pudo generar el resumen
ja: ダイジェストを生成できませんでした
zh_cn: 无法生成摘要

# Digest_GeneratedAtFormat
source: {0:MMM d, yyyy} at {0:h:mm tt}
de: {0:d. MMM yyyy} um {0:HH:mm}
es: {0:d 'de' MMM 'de' yyyy} a las {0:H:mm}
ja: {0:yyyy年M月d日} {0:H:mm}
zh_cn: {0:yyyy年M月d日} {0:HH:mm}

# Digest_PeriodFormat
source: {0:MMM d} - {1:MMM d, yyyy}
de: {0:d. MMM} - {1:d. MMM yyyy}
es: {0:d 'de' MMM} - {1:d 'de' MMM 'de' yyyy}
ja: {0:M月d日} - {1:yyyy年M月d日}
zh_cn: {0:M月d日} - {1:yyyy年M月d日}

# Digest_ShortPeriodFormat
source: {0:MMM d} - {1:MMM d}
de: {0:d. MMM} - {1:d. MMM}
es: {0:d 'de' MMM} - {1:d 'de' MMM}
ja: {0:M月d日} - {1:M月d日}
zh_cn: {0:M月d日} - {1:M月d日}

# Digest_TrendNew
source: new this period
de: neu in diesem Zeitraum
es: nuevo en este período
ja: 今期間の新規
zh_cn: 本时段新增

# Digest_TrendChange
source: {0} vs prior period
de: {0} ggü. Vorzeitraum
es: {0} respecto al período anterior
ja: 前期間比 {0}
zh_cn: 较上一时段 {0}

# Digest_TrendFlat
source: flat vs prior period
de: unverändert ggü. Vorzeitraum
es: sin cambios respecto al período anterior
ja: 前期間から変化なし
zh_cn: 与上一时段持平

# WfBuilder_NoResultToSave
source: No workflow result available to save
de: Kein Workflow-Ergebnis zum Speichern vorhanden
es: No hay ningún resultado del flujo de trabajo para guardar
ja: 保存できるワークフローの結果がありません
zh_cn: 没有可保存的工作流结果

# WfBuilder_ResolvedRunBySaving
source: Resolved the focused workflow run by saving it to Knowledge Vault as "{0}".
de: Die fokussierte Workflow-Ausführung wurde erledigt: als „{0}“ im Wissens-Tresor gespeichert.
es: Se resolvió la ejecución enfocada del flujo de trabajo guardándola en la Bóveda de Conocimiento como "{0}".
ja: フォーカス中のワークフロー実行を「{0}」として Knowledge Vault に保存し、対応済みにしました。
zh_cn: 已将聚焦的工作流运行以“{0}”保存到 Knowledge Vault，并标记为已处理。

# WfBuilder_SavedResultToVault
source: Saved workflow result to Knowledge Vault as "{0}"
de: Workflow-Ergebnis als „{0}“ im Wissens-Tresor gespeichert
es: Resultado del flujo de trabajo guardado en la Bóveda de Conocimiento como "{0}"
ja: ワークフローの結果を「{0}」として Knowledge Vault に保存しました
zh_cn: 已将工作流结果以“{0}”保存到 Knowledge Vault

# WfBuilder_StoredRunNothingToSave
source: This stored run does not have result content to save
de: Diese gespeicherte Ausführung enthält kein Ergebnis zum Speichern
es: Esta ejecución guardada no tiene ningún resultado para guardar
ja: この保存済みの実行には保存できる結果がありません
zh_cn: 此已保存的运行没有可保存的结果内容

# WfBuilder_SavedStoredResultToVault
source: Saved stored workflow result to Knowledge Vault as "{0}"
de: Gespeichertes Workflow-Ergebnis als „{0}“ im Wissens-Tresor abgelegt
es: Resultado guardado del flujo de trabajo añadido a la Bóveda de Conocimiento como "{0}"
ja: 保存済みのワークフロー結果を「{0}」として Knowledge Vault に保存しました
zh_cn: 已将已保存的工作流结果以“{0}”保存到 Knowledge Vault

# WfBuilder_NoResultToExport
source: No workflow result available to export.
de: Kein Workflow-Ergebnis zum Exportieren vorhanden.
es: No hay ningún resultado del flujo de trabajo para exportar.
ja: エクスポートできるワークフローの結果がありません。
zh_cn: 没有可导出的工作流结果。

# WfBuilder_ResolvedRunByExporting
source: Resolved the focused workflow run by exporting it to {0}.
de: Die fokussierte Workflow-Ausführung wurde erledigt: nach {0} exportiert.
es: Se resolvió la ejecución enfocada del flujo de trabajo exportándola a {0}.
ja: フォーカス中のワークフロー実行を {0} にエクスポートし、対応済みにしました。
zh_cn: 已将聚焦的工作流运行导出到 {0}，并标记为已处理。

# WfBuilder_ExportedResult
source: Exported workflow result to {0}
de: Workflow-Ergebnis nach {0} exportiert
es: Resultado del flujo de trabajo exportado a {0}
ja: ワークフローの結果を {0} にエクスポートしました
zh_cn: 已将工作流结果导出到 {0}

# WfBuilder_NoRunSelectedToExport
source: No workflow run selected for export.
de: Keine Workflow-Ausführung zum Exportieren ausgewählt.
es: No se seleccionó ninguna ejecución del flujo de trabajo para exportar.
ja: エクスポートするワークフロー実行が選択されていません。
zh_cn: 未选择要导出的工作流运行。

# WfBuilder_StoredRunNothingToExport
source: This stored run does not have result content to export.
de: Diese gespeicherte Ausführung enthält kein Ergebnis zum Exportieren.
es: Esta ejecución guardada no tiene ningún resultado para exportar.
ja: この保存済みの実行にはエクスポートできる結果がありません。
zh_cn: 此已保存的运行没有可导出的结果内容。

# WfBuilder_ExportedStoredResult
source: Exported stored workflow result to {0}
de: Gespeichertes Workflow-Ergebnis nach {0} exportiert
es: Resultado guardado del flujo de trabajo exportado a {0}
ja: 保存済みのワークフロー結果を {0} にエクスポートしました
zh_cn: 已将已保存的工作流结果导出到 {0}

# WfBuilder_LoadWorkflowsFailed
source: Failed to load workflows
de: Workflows konnten nicht geladen werden
es: No se pudieron cargar los flujos de trabajo
ja: ワークフローを読み込めませんでした
zh_cn: 无法加载工作流

# WfBuilder_NewWorkflowName
source: New Workflow
de: Neuer Workflow
es: Nuevo flujo de trabajo
ja: 新しいワークフロー
zh_cn: 新建工作流

# WfBuilder_UseTemplateToCustomize
source: Use Template to customize built-in workflows
de: Verwenden Sie „Vorlage verwenden“, um integrierte Workflows anzupassen
es: Use 'Usar plantilla' para personalizar los flujos de trabajo integrados
ja: 組み込みのワークフローをカスタマイズするには [テンプレートを使用] を選択してください
zh_cn: 请使用“使用模板”来自定义内置工作流

# WfBuilder_ExportWorkflowFailed
source: Export failed
de: Export fehlgeschlagen
es: Error al exportar
ja: エクスポートに失敗しました
zh_cn: 导出失败

# WfBuilder_CreatedFromTemplate
source: Created workflow "{0}" from template
de: Workflow „{0}“ aus Vorlage erstellt
es: Flujo de trabajo "{0}" creado a partir de la plantilla
ja: テンプレートからワークフロー「{0}」を作成しました
zh_cn: 已从模板创建工作流“{0}”

# WfBuilder_CreateFromTemplateFailed
source: Failed to create workflow from template
de: Workflow konnte nicht aus der Vorlage erstellt werden
es: No se pudo crear el flujo de trabajo a partir de la plantilla
ja: テンプレートからワークフローを作成できませんでした
zh_cn: 无法从模板创建工作流

# WfBuilder_SelectedTemplate
source: Selected template "{0}"
de: Vorlage „{0}“ ausgewählt
es: Plantilla "{0}" seleccionada
ja: テンプレート「{0}」を選択しました
zh_cn: 已选择模板“{0}”

# WfBuilder_WorkflowSaved
source: Workflow "{0}" saved
de: Workflow „{0}“ gespeichert
es: Flujo de trabajo "{0}" guardado
ja: ワークフロー「{0}」を保存しました
zh_cn: 工作流“{0}”已保存

# WfBuilder_SavedAsNewWorkflow
source: Built-in workflow "{0}" was not changed; your edits were saved as the new workflow "{1}"
de: Der integrierte Workflow „{0}“ wurde nicht geändert; Ihre Änderungen wurden als neuer Workflow „{1}“ gespeichert
es: El flujo de trabajo integrado "{0}" no se modificó; sus cambios se guardaron como el nuevo flujo de trabajo "{1}"
ja: 組み込みのワークフロー「{0}」は変更されていません。編集内容は新しいワークフロー「{1}」として保存されました
zh_cn: 内置工作流“{0}”未被更改；您的编辑已保存为新工作流“{1}”

# WfBuilder_SaveWorkflowFailed
source: Failed to save workflow
de: Workflow konnte nicht gespeichert werden
es: No se pudo guardar el flujo de trabajo
ja: ワークフローを保存できませんでした
zh_cn: 无法保存工作流

# WfBuilder_DefaultStepName
source: Step {0}
de: Schritt {0}
es: Paso {0}
ja: ステップ {0}
zh_cn: 步骤 {0}

# WfBuilder_WorkflowDeleted
source: Workflow deleted
de: Workflow gelöscht
es: Flujo de trabajo eliminado
ja: ワークフローを削除しました
zh_cn: 工作流已删除

# WfBuilder_DeleteWorkflowFailed
source: Failed to delete workflow
de: Workflow konnte nicht gelöscht werden
es: No se pudo eliminar el flujo de trabajo
ja: ワークフローを削除できませんでした
zh_cn: 无法删除工作流

# WfBuilder_EnterInputToProcess
source: Please enter input text to process
de: Bitte geben Sie den zu verarbeitenden Text ein
es: Introduzca el texto que desea procesar
ja: 処理するテキストを入力してください
zh_cn: 请输入要处理的文本

# WfBuilder_ShowingLatestResult
source: Showing latest execution result
de: Neuestes Ausführungsergebnis wird angezeigt
es: Se muestra el resultado de la última ejecución
ja: 最新の実行結果を表示しています
zh_cn: 正在显示最新的运行结果

# WfBuilder_StepsFailed
source: One or more steps failed. Check step outputs for details.
de: Mindestens ein Schritt ist fehlgeschlagen. Details finden Sie in den Schritt-Ausgaben.
es: Uno o más pasos fallaron. Consulte las salidas de los pasos para ver los detalles.
ja: 1 つ以上のステップが失敗しました。詳細はステップの出力を確認してください。
zh_cn: 一个或多个步骤失败。请查看步骤输出了解详情。

# WfBuilder_WorkflowCompleted
source: Workflow completed in {0}ms
de: Workflow in {0} ms abgeschlossen
es: Flujo de trabajo completado en {0} ms
ja: ワークフローが完了しました ({0} ms)
zh_cn: 工作流已完成（{0} ms）

# WfBuilder_WorkflowFailed
source: Workflow failed
de: Workflow fehlgeschlagen
es: El flujo de trabajo falló
ja: ワークフローが失敗しました
zh_cn: 工作流失败

# WfBuilder_ExecutionFailed
source: Workflow execution failed
de: Workflow-Ausführung fehlgeschlagen
es: Error al ejecutar el flujo de trabajo
ja: ワークフローの実行に失敗しました
zh_cn: 工作流运行失败

# WfBuilder_ShowingFailedResult
source: Showing the failed execution result
de: Ergebnis der fehlgeschlagenen Ausführung wird angezeigt
es: Se muestra el resultado de la ejecución fallida
ja: 失敗した実行の結果を表示しています
zh_cn: 正在显示失败的运行结果

# WfBuilder_RunCancelledByUser
source: Cancelled by user
de: Vom Benutzer abgebrochen
es: Cancelado por el usuario
ja: ユーザーによってキャンセルされました
zh_cn: 已被用户取消

# WfBuilder_ShowingCancelledResult
source: Showing the cancelled execution result
de: Ergebnis der abgebrochenen Ausführung wird angezeigt
es: Se muestra el resultado de la ejecución cancelada
ja: キャンセルされた実行の結果を表示しています
zh_cn: 正在显示已取消的运行结果

# WfBuilder_WorkflowCancelled
source: Workflow cancelled
de: Workflow abgebrochen
es: Flujo de trabajo cancelado
ja: ワークフローをキャンセルしました
zh_cn: 工作流已取消

# WfBuilder_ImportedWorkflow
source: Imported workflow "{0}"
de: Workflow „{0}“ importiert
es: Flujo de trabajo "{0}" importado
ja: ワークフロー「{0}」をインポートしました
zh_cn: 已导入工作流“{0}”

# WfBuilder_ImportInvalidJson
source: Import failed — invalid workflow JSON
de: Import fehlgeschlagen — ungültiges Workflow-JSON
es: Error en la importación — JSON de flujo de trabajo no válido
ja: インポートに失敗しました — ワークフローの JSON が無効です
zh_cn: 导入失败 — 工作流 JSON 无效

# WfBuilder_LoadRecentRunsFailed
source: Failed to load recent workflow runs
de: Letzte Workflow-Ausführungen konnten nicht geladen werden
es: No se pudieron cargar las ejecuciones recientes del flujo de trabajo
ja: 最近のワークフロー実行を読み込めませんでした
zh_cn: 无法加载最近的工作流运行

# WfBuilder_RequestedRunUnavailable
source: The requested workflow run is no longer available.
de: Die angeforderte Workflow-Ausführung ist nicht mehr verfügbar.
es: La ejecución del flujo de trabajo solicitada ya no está disponible.
ja: 要求されたワークフロー実行は利用できなくなりました。
zh_cn: 请求的工作流运行已不可用。

# WfBuilder_RequestedRunNotInHistory
source: The requested workflow run is no longer in recent history.
de: Die angeforderte Workflow-Ausführung ist nicht mehr im Verlauf der letzten Ausführungen.
es: La ejecución del flujo de trabajo solicitada ya no está en el historial reciente.
ja: 要求されたワークフロー実行は最近の履歴に含まれなくなりました。
zh_cn: 请求的工作流运行已不在最近的历史记录中。
